c5/src/DataProcessors/PromoCodes/PromoCodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>PromoCodes</name>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Count</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountPeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpirationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Folder</name>
    <type>
      <types>CatalogRef.PromoCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>IssueDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

c5/src/Catalogs/PromoCodes/PromoCodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PromoCodes</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentTenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountPeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpirationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssueDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/DataProcessors/PromoCodes/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	setIssueDate ();
	
EndProcedure

&AtServer
Procedure setIssueDate ()
	
	Object.IssueDate = CurrentSessionDate ();
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure Generate ( Command )
	
	Output.GeneratePromoCodesConfirmation ( ThisObject );
	
EndProcedure

&AtClient
Procedure GeneratePromoCodesConfirmation ( Answer, Params ) export
	
	if ( Answer = DialogReturnCode.No ) then
		return;
	endif; 
	if ( not CheckFilling () ) then
		return;
	endif; 
	generateCodes ();
	
EndProcedure 

&AtServer
Procedure generateCodes ()
	
	BeginTransaction ();
	Codes.Clear ();
	t = DataProcessors.PromoCodes.GetTemplate ( "Template" );
	Codes.Put ( t.GetArea ( "Header" ) );
	area = t.GetArea ( "Row" );
	agentTenant = DF.Pick ( Object.Agent, "Tenant" );
	for i = 1 to Object.Count do
		obj = Catalogs.PromoCodes.CreateItem ();
		FillPropertyValues ( obj, Object );
		obj.Code = getCode ();
		obj.Parent = Object.Folder;
		obj.AgentTenant = agentTenant;
		obj.Write ();
		area.Parameters.Fill ( obj );
		Codes.Put ( area );
	enddo; 
	CommitTransaction ();
	
EndProcedure 

&AtServer
Function getCode ()
	
	code = Upper ( Left ( StrReplace ( new UUID (), "-", "" ), 9 ) );
	if ( Catalogs.PromoCodes.FindByCode ( code ).IsEmpty () ) then
		return code;
	else
		return getCode ();
	endif; 
	
EndFunction
